{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1024, 2], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "complex_conv1d_7", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_7", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [1], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "complex_batch_normalization_6", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_7", 0, 0, {}]]]}, {"name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_6", 0, 0, {}]]]}, {"name": "get_channel0_6", "class_name": "GetChannel0", "config": {"name": "get_channel0_6", "trainable": true}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "complex_conv1d_8", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_8", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [2], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["get_channel0_6", 0, 0, {}]]]}, {"name": "complex_batch_normalization_7", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_8", 0, 0, {}]]]}, {"name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_7", 0, 0, {}]]]}, {"name": "get_channel0_7", "class_name": "GetChannel0", "config": {"name": "get_channel0_7", "trainable": true}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "complex_conv1d_9", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_9", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [2], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["get_channel0_7", 0, 0, {}]]]}, {"name": "complex_batch_normalization_8", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_9", 0, 0, {}]]]}, {"name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_8", 0, 0, {}]]]}, {"name": "get_channel0_8", "class_name": "GetChannel0", "config": {"name": "get_channel0_8", "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "complex_conv1d_10", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_10", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [2], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["get_channel0_8", 0, 0, {}]]]}, {"name": "complex_batch_normalization_9", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_10", 0, 0, {}]]]}, {"name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_9", 0, 0, {}]]]}, {"name": "get_channel0_9", "class_name": "GetChannel0", "config": {"name": "get_channel0_9", "trainable": true}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "complex_conv1d_11", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_11", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [2], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["get_channel0_9", 0, 0, {}]]]}, {"name": "complex_batch_normalization_10", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_11", 0, 0, {}]]]}, {"name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_10", 0, 0, {}]]]}, {"name": "get_channel0_10", "class_name": "GetChannel0", "config": {"name": "get_channel0_10", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "complex_conv1d_12", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_12", "trainable": true, "filters": 2, "kernel_size": [4], "strides": [1], "padding": "causal", "dilation_rate": [2], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["get_channel0_10", 0, 0, {}]]]}, {"name": "complex_batch_normalization_11", "class_name": "ComplexBatchNormalization", "config": {"name": "complex_batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": "sqrt_init", "moving_covariance_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "beta_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null}, "inbound_nodes": [[["complex_conv1d_12", 0, 0, {}]]]}, {"name": "elu_6", "class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["complex_batch_normalization_11", 0, 0, {}]]]}, {"name": "get_channels_6", "class_name": "GetChannels", "config": {"name": "get_channels_6", "trainable": true}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "get_channels_7", "class_name": "GetChannels", "config": {"name": "get_channels_7", "trainable": true}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "get_channels_8", "class_name": "GetChannels", "config": {"name": "get_channels_8", "trainable": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "get_channels_9", "class_name": "GetChannels", "config": {"name": "get_channels_9", "trainable": true}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "get_channels_10", "class_name": "GetChannels", "config": {"name": "get_channels_10", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "get_channels_11", "class_name": "GetChannels", "config": {"name": "get_channels_11", "trainable": true}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "get_channel0_11", "class_name": "GetChannel0", "config": {"name": "get_channel0_11", "trainable": true}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "complex_concatenate_2", "class_name": "ComplexConcatenate", "config": {"name": "complex_concatenate_2", "trainable": true}, "inbound_nodes": [[["get_channels_6", 0, 0, {}], ["get_channels_7", 0, 0, {}], ["get_channels_8", 0, 0, {}], ["get_channels_9", 0, 0, {}], ["get_channels_10", 0, 0, {}], ["get_channels_11", 0, 0, {}], ["get_channel0_11", 0, 0, {}]]]}, {"name": "complex_conv1d_13", "class_name": "ComplexConv1D", "config": {"name": "complex_conv1d_13", "trainable": true, "filters": 1, "kernel_size": [1], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "linear", "use_bias": false, "normalize_weight": false, "kernel_initializer": "complex", "bias_initializer": {"class_name": "Zeros", "config": {}}, "gamma_diag_initializer": "sqrt_init", "gamma_off_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0020000000949949026}}, "bias_regularizer": null, "gamma_diag_regularizer": null, "gamma_off_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "gamma_diag_constraint": null, "gamma_off_constraint": null, "init_criterion": "he", "spectral_parametrization": false}, "inbound_nodes": [[["complex_concatenate_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["complex_conv1d_13", 0, 0]]}, "keras_version": "2.2.4", "backend": "theano"}